In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [2]:
import pandas.util.testing as tm; tm.N = 3

In [3]:
def unpivot(frame):
    N, K = frame.shape
    
    data = {'value': frame.values.ravel('F'),
            'variable': np.asarray(frame.columns).repeat(N),
            'date': np.tile(np.asarray(frame.index), K)}
    
    return DataFrame(data, columns=['date', 'variable', 'value'])

df1 = unpivot(tm.makeTimeDataFrame())

In [4]:
df1

         date variable     value
0  2000-01-03        A -0.069196
1  2000-01-04        A -1.449913
2  2000-01-05        A -0.694833
3  2000-01-03        B -0.249331
4  2000-01-04        B  0.406231
5  2000-01-05        B -1.138497
6  2000-01-03        C -1.332290
7  2000-01-04        C  0.621361
8  2000-01-05        C -1.246016
9  2000-01-03        D  0.199235
10 2000-01-04        D  0.457150
11 2000-01-05        D  0.844425

In [5]:
df_pivot = df1.pivot('date', 'variable', 'value')

In [6]:
df_pivot

variable           A         B         C         D
date
2000-01-03 -0.069196 -0.249331 -1.332290  0.199235
2000-01-04 -1.449913  0.406231  0.621361  0.457150
2000-01-05 -0.694833 -1.138497 -1.246016  0.844425